# Basic

In [1]:
import pandas as pd

In [4]:
Data = {
    'Name' : ['Aditya' , 'Shriyas' , 'Anup'],
    'Age' : [21,23,22],
    'Roll_no' : [13,23,16],
}

In [5]:
df = pd.DataFrame(Data)

In [6]:
print(df)

      Name  Age  Roll_no
0   Aditya   21       13
1  Shriyas   23       23
2     Anup   22       16

# To print the top 5 data

In [7]:
df.head()

      Name  Age  Roll_no
0   Aditya   21       13
1  Shriyas   23       23
2     Anup   22       16

# To print the bottom 5 data

In [8]:
df.tail()

      Name  Age  Roll_no
0   Aditya   21       13
1  Shriyas   23       23
2     Anup   22       16

# We can also give the parameters in the head...to get the required no. of data

In [11]:
df.head(2)

      Name  Age  Roll_no
0   Aditya   21       13
1  Shriyas   23       23

In [12]:
df.tail(2)

      Name  Age  Roll_no
1  Shriyas   23       23
2     Anup   22       16

In [14]:
df.shape

(3, 3)

In [21]:
df['Name']

0     Aditya
1    Shriyas
2       Anup
Name: Name, dtype: object

In [28]:
df[1:3]

      Name  Age  Roll_no
1  Shriyas   23       23
2     Anup   22       16

In [29]:
df[:]

      Name  Age  Roll_no
0   Aditya   21       13
1  Shriyas   23       23
2     Anup   22       16

In [30]:
df

      Name  Age  Roll_no
0   Aditya   21       13
1  Shriyas   23       23
2     Anup   22       16

In [31]:
df.columns

Index(['Name', 'Age', 'Roll_no'], dtype='object')

In [32]:
df.Name

0     Aditya
1    Shriyas
2       Anup
Name: Name, dtype: object

In [34]:
df['Name']

0     Aditya
1    Shriyas
2       Anup
Name: Name, dtype: object

In [35]:
df.Roll_no.max()

np.int64(23)

In [36]:
df.Name.count()

np.int64(3)

In [37]:
df.Age.min()

np.int64(21)

In [39]:
df.Age.std()

np.float64(1.0)

In [40]:
df.describe()

        Age    Roll_no
count   3.0   3.000000
mean   22.0  17.333333
std     1.0   5.131601
min    21.0  13.000000
25%    21.5  14.500000
50%    22.0  16.000000
75%    22.5  19.500000
max    23.0  23.000000

In [42]:
df[df.Age > 22]

      Name  Age  Roll_no
1  Shriyas   23       23

In [45]:
df.Name[df.Age == 21]

0    Aditya
Name: Name, dtype: object

In [46]:
df[df.Age == df.Age.max()]

      Name  Age  Roll_no
1  Shriyas   23       23

In [56]:
df[['Name' , 'Roll_no']][df.Age == df.Age.max()]

      Name  Roll_no
1  Shriyas       23

# Set_index()

In [58]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [59]:
df.set_index('Name')

         Age  Roll_no
Name
Aditya    21       13
Shriyas   23       23
Anup      22       16

In [70]:
df.reset_index( inplace = True)

In [71]:
df

      Name  Age  Roll_no
0   Aditya   21       13
1  Shriyas   23       23
2     Anup   22       16

In [72]:
df.set_index("Name" ,inplace = True)

In [73]:
df

         Age  Roll_no
Name
Aditya    21       13
Shriyas   23       23
Anup      22       16

In [75]:
df.loc['Aditya']

Age        21
Roll_no    13
Name: Aditya, dtype: int64